DataProcessors/ПереносДанныхИзМакетаДляКнфигурацииЭкспертизаСертификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>ПереносДанныхИзМакетаДляКнфигурацииЭкспертизаСертификации</Name>
		</Properties>
		<ChildObjects>
			<Form>Форма</Form>

Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Comment>Контрагент</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИзменитьНаим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоИностранныйКонтрагент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьЗаказчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОЗаказчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетНаОсновании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Comment>Тип</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Comment>Вид</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнфоДляПечати</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДолжностьЗаказчика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИОЗаказчика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетНаОсновании</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияНаименований</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоДаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкрытыйРеквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолнНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>550</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьПриПересчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВСумме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Аналоги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аналог</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Совместимость</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПереносДанныхИзМакетаДляКнфигурацииЭкспертизаСертификации/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура УдалитьВсехКотрагентовНаСервере()
	
	
	  выб=справочники.Контрагенты.Выбрать();
	  Пока выб.Следующий() цикл
		  выб.ПолучитьОбъект().Удалить();
		  
	  КонецЦикла;
	  
	
	
	
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсехКотрагентов(Команда)
	УдалитьВсехКотрагентовНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьВсюНоменклатуруНаСервере()
		  выб=справочники.Номенклатура.Выбрать();
	  Пока выб.Следующий() цикл
		  выб.ПолучитьОбъект().Удалить();
		  
	  КонецЦикла;

	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсюНоменклатуру(Команда)
	УдалитьВсюНоменклатуруНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНоменклатуруНаСервере()
	
	      ЭтотОтчет = РеквизитФормыВЗначение("Объект");
    Макет = ЭтотОтчет.ПолучитьМакет("Номенклатура");
	
	НачинатьССтроки=2;
	
	тд=Макет;
	
	ии=НачинатьССтроки;
	текгруппа="";
	Пока истина цикл
		
		пометка=  тд.Область(ии,1,ии,1).Текст  ;
			Если  пометка=""  тогда
			Прервать;
		Конецесли ;
		Если  пометка="истина"  тогда
			ии=ии+1;
			Продолжить;;
		Конецесли ;
		
		
		
		этогруппа=тд.Область(ии,1,ии,1).ЦветФона.Вид=ВидЦвета.Абсолютный;
		
		
		Если этогруппа тогда
			спр=Справочники.Номенклатура.СоздатьГруппу();
			спр.Наименование=тд.Область(ии,3,ии,3).Текст ;
			спр.код=тд.Область(ии,2,ии,2).Текст ;

			спр.ОбменДанными.Загрузка=истина;
			спр.Записать();
			текгруппа=спр.Ссылка;

		иначе
			 спр=Справочники.Номенклатура.Создатьэлемент();
			 спр.Наименование=тд.Область(ии,3,ии,3).Текст ;
			спр.код=тд.Область(ии,2,ии,2).Текст ;

			спр.Родитель=текгруппа;
			спр.ПолнНаименование=тд.Область(ии,4,ии,4).Текст; 
			спр.Цена=тд.Область(ии,6,ии,6).Текст ;
			
			спр.ОбменДанными.Загрузка=истина;
			спр.Записать();
 
			 
			 
			 
			 

		КонецЕсли;
		
		
			 		
		
		
	
	
	      ии=ии+1;
	  КонецЦикла;
	  
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНоменклатуру(Команда)
	ЗагрузитьНоменклатуруНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКонтрагентовНаСервере()
	  ЭтотОтчет = РеквизитФормыВЗначение("Объект");
    Макет = ЭтотОтчет.ПолучитьМакет("Контрагенты");
	
	НачинатьССтроки=2;
	
	тд=Макет;
	
	ии=НачинатьССтроки;
	текгруппа="";
	Пока истина цикл
		
		пометка=  тд.Область(ии,1,ии,1).Текст  ;
			Если  пометка=""  тогда
			Прервать;
		Конецесли ;
		Если  пометка="истина"  тогда
			ии=ии+1;
			Продолжить;;
		Конецесли ;
		
		
		
		этогруппа=тд.Область(ии,1,ии,1).ЦветФона.Вид=ВидЦвета.Абсолютный;
		
		
		Если этогруппа тогда
			спр=Справочники.Контрагенты.СоздатьГруппу();
			спр.Наименование=тд.Область(ии,3,ии,3).Текст ;
			спр.код=тд.Область(ии,2,ии,2).Текст ;

			спр.ОбменДанными.Загрузка=истина;
			спр.Записать();
			текгруппа=спр.Ссылка;

		иначе
			 спр=Справочники.Контрагенты.Создатьэлемент();
			 спр.Наименование=тд.Область(ии,3,ии,3).Текст ;
			спр.код=тд.Область(ии,2,ии,2).Текст ;

			спр.Родитель=текгруппа;
			спр.НаименованиеПолное=тд.Область(ии,5,ии,5).Текст; 
			спр.ВидКонтрагента=?(тд.Область(ии,4,ии,4).Текст="Физ. лицо",Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо ,Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо ) ;
			инн=тд.Область(ии,9,ии,9).Текст ;
			разд=СтрНайти(инн,"/")+СтрНайти(инн,"\")  ;
			если разд>0 тогда
				спр.инн=лев(инн,разд-1);
				спр.кпп=сред(инн,разд+1);
			иначе
				спр.инн=инн;

			КонецЕсли;
			 спр.КодПоОКПО=тд.Область(ии,14,ии,14).Текст ;
			спр.ОГРН  =  тд.Область(ии,17,ии,17).Текст  ;
			спр.ОКВЭД=  тд.Область(ии,20,ии,20).Текст  ;
			спр.Комментарий=  тд.Область(ии,19,ии,19).Текст  ;
			
			спр.ДолжностьЗаказчика  =   тд.Область(ии,15,ии,15).Текст  ;

			спр.ФИОЗаказчика=  тд.Область(ии,16,ии,16).Текст  ;

			спр.ДействуетНаОсновании= тд.Область(ии,21,ии,21).Текст  ;
			
			
			
			спр.ДокументСерия =    тд.Область(ии,10,ии,10).Текст  ;

			спр.ДокументНомер =     тд.Область(ии,11,ии,11).Текст  ;

			спр.ДокументДатаВыдачи  =   тд.Область(ии,13,ии,13).Текст  ;

			спр.ДокументКемВыдан   =тд.Область(ии,12,ии,12).Текст  ;


			
			
			
			строк= тд.Область(ии,6,ии,6).Текст  ;

			Если не ПустаяСтрока(строк) тогда
				
				стрк=спр.КонтактнаяИнформация.Добавить();
				стрк.тип=Перечисления.ТипыКонтактнойИнформации.Адрес;
				стрк.вид=Справочники.ВидыКонтактнойИнформации.АдресКонтрагента;
				стрк.Представление=строк;
				
				
			КонецЕсли;
			

			
			строк= тд.Область(ии,7,ии,7).Текст  ;

			Если не ПустаяСтрока(строк) тогда
				
				стрк=спр.КонтактнаяИнформация.Добавить();
				стрк.тип=Перечисления.ТипыКонтактнойИнформации.Адрес;
				стрк.вид=Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента;
				стрк.Представление=строк;
				
				
			КонецЕсли;
			
				строк= тд.Область(ии,8,ии,8).Текст  ;

			Если не ПустаяСтрока(строк) тогда
				
				стрк=спр.КонтактнаяИнформация.Добавить();
				стрк.тип=Перечисления.ТипыКонтактнойИнформации.Телефон;
				стрк.вид=Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
				стрк.Представление=строк;
				стрк.НомерТелефона=строк;

				
			КонецЕсли;


			
			
					  строк= тд.Область(ии,18,ии,18).Текст  ;

		Если не ПустаяСтрока(стрк) тогда
				
				стрк=спр.КонтактнаяИнформация.Добавить();
				стрк.тип=Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
				стрк.вид=Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
				стрк.Представление=строк;
				стрк.АдресЭП=строк;

				
		КонецЕсли;

			
			
			
			
			
			спр.ОбменДанными.Загрузка=истина;
			спр.Записать();
 
			 
			 
			 
			 

		КонецЕсли;
		
		
			 		
		
		
	
	
	      ии=ии+1;
	  КонецЦикла;
	  
	

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКонтрагентов(Команда)
	ЗагрузитьКонтрагентовНаСервере();
КонецПроцедуры
